OFtutorialTest04_MRF/simpleFoam/turbine/0/Urel
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      Urel;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
50904
(
(96.8894 -376.077 0)
(94.762 -369.089 0)
(88.8565 -375.058 0)
(87.1105 -368.721 0)
(97.1046 -376.079 0)
(94.9703 -369.079 0)
(89.0348 -375.063 0)
(87.2837 -368.715 0)
...
)
;

boundaryField
{
    HUB
    {
        type            noSlip;
    }
    SHROUD
    {
        type            noSlip;
    }
    INFLOW
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    OUTFLOW
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    BLADE
    {
        type            noSlip;
    }
    PER1
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
    PER2
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
